week 2/lab2_part2/pipe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          320;
        startFace       75200;
    }
    outlet
    {
        type            patch;
        nFaces          320;
        startFace       75520;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2560;
        startFace       75840;
    }
)

// ************************************************************************* //
