week 2/lab2_part2/pipe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)     // vertex 0
    (2.64022 2.64022 0)   // vertex 1
    (-2.64022 2.64022 0)  // vertex 2
    (-2.64022 -2.64022 0) // vertex 3
    (2.64022 -2.64022 0)  // vertex 4
    (6.22254 6.22254 0)   // vertex 5
    (-6.22254 6.22254 0)  // vertex 6
    (-6.22254 -6.22254 0) // vertex 7
    (6.22254 -6.22254 0)  // vertex 8
    (2.64022 2.64022 176)  // vertex 9
    (-2.64022 2.64022 176) // vertex 10
    (-2.64022 -2.64022 176)    // vertex 11
    (2.64022 -2.64022 176) // vertex 12
    (6.22254 6.22254 176)  // vertex 13
    (-6.22254 6.22254 176) // vertex 14
    (-6.22254 -6.22254 176)// vertex 15
    (6.22254 -6.22254 176) // vertex 16
    (0 0 176)        // vertex 17
);


blocks
(
    hex (1 2 3 4 9 10 11 12) (8 8 80) simpleGrading (1 1 1) // block 1
    hex (1 5 6 2 9 13 14 10) (8 8 80) simpleGrading (1 1 1) // block 2
    hex (2 6 7 3 10 14 15 11) (8 8 80) simpleGrading (1 1 1)    // block 3
    hex (3 7 8 4 11 15 16 12) (8 8 80) simpleGrading (1 1 1)    // block 4
    hex (8 5 1 4 16 13 9 12) (8 8 80) simpleGrading (1 1 1) // block 5
);

edges
(
    arc 5 6 (0 8.8 0)       // edge 1
    arc 6 7 (-8.8 0 0)      // edge 2
    arc 7 8 (0 -8.8 0)      // edge 3
    arc 8 5 (8.8 0 0)       // edge 4
    arc 1 2 (0 3.73384 0)  // edge 5
    arc 2 3 (-3.73384 0 0) // edge 6
    arc 3 4 (0 -3.73384 0) // edge 7
    arc 4 1 (3.73384 0 0)  // edge 8

    arc 13 14 (0 8.8 176)    // edge 9
    arc 14 15 (-8.8 0 176)   // edge 10
    arc 15 16 (0 -8.8 176)   // edge 11
    arc 16 13 (8.8 0 176)    // edge 12
    arc 9 10 (0 3.73384 176)    // edge 13
    arc 10 11 (-3.73384 0 176)  // edge 14
    arc 11 12 (0 -3.73384 176)  // edge 15
    arc 12 9 (3.73384 0 176)    // edge 16
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 3 4)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 8 4)
            (4 8 5 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 10 11 12)
            (9 10 14 13)
            (10 11 15 14)
            (11 12 16 15)
            (12 9 13 16)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (13 14 6 5)
            (14 15 7 6)
            (15 16 8 7)
            (16 13 5 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //


// ************************************************************************* //
